Importing The required Libraries

In [ ]:
import sqlalchemy as sqla
import pandas as pd

Creating an Engine object to connect with Database.

In [36]:
db = sqla.create_engine('sqlite:///C:/sqlLite/country_club.db')

Printing data from Facilities table

In [37]:
pd.read_sql('select * from Facilities',db)

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

Printing data from Members table

In [38]:
pd.read_sql('select * from Members',db)

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05
5,5,Butters,Gerald,"1065 Huntingdon Avenue, Boston",56754,(844) 078-4130,1,2012-07-09 10:44:09
6,6,Tracy,Burton,"3 Tunisia Drive, Boston",45678,(822) 354-9973,,2012-07-15 08:52:55
7,7,Dare,Nancy,"6 Hunting Lodge Way, Boston",10383,(833) 776-4001,4,2012-07-25 08:59:12
8,8,Boothe,Tim,"3 Bloomsbury Close, Reading, 00234",234,(811) 433-2547,3,2012-07-25 16:02:35
9,9,Stibbons,Ponder,"5 Dragons Way, Winchester",87630,(833) 160-3900,6,2012-07-25 17:09:05
10,10,Owen,Charles,"52 Cheshire Grove, Winchester, 28563",28563,(855) 542-5251,1,2012-08-03 19:42:37
11,11,Jones,David,"976 Gnats Close, Reading",33862,(844) 536-8036,4,2012-08-06 16:32:55
12,12,Baker,Anne,"55 Powdery Street, Boston",80743,844-076-5141,9,2012-08-10 14:23:22
13,13,Farrell,Jemima,"103 Firth Avenue, North Reading",57392,(855) 016-0163,,2012-08-10 14:28:01
14,14,Smith,Jack,"252 Binkington Way, Boston",69302,(822) 163-3254,1,2012-08-10 16:22:05
15,15,Bader,Florence,"264 Ursula Drive, Westford",84923,(833) 499-3527,9,2012-08-10 17:52:03
16,16,Baker,Timothy,"329 James Street, Reading",58393,833-941-0824,13,2012-08-15 10:34:25
17,17,Pinker,David,"5 Impreza Road, Boston",65332,811 409-6734,13,2012-08-16 11:32:47
18,20,Genting,Matthew,"4 Nunnington Place, Wingfield, Boston",52365,(811) 972-1377,5,2012-08-19 14:55:55
19,21,Mackenzie,Anna,"64 Perkington Lane, Reading",64577,(822) 661-2898,1,2012-08-26 09:32:05
20,22,Coplin,Joan,"85 Bard Street, Bloomington, Boston",43533,(822) 499-2232,16,2012-08-29 08:32:41
21,24,Sarwin,Ramnaresh,"12 Bullington Lane, Boston",65464,(822) 413-1470,15,2012-09-01 08:44:42
22,26,Jones,Douglas,"976 Gnats Close, Reading",11986,844 536-8036,11,2012-09-02 18:43:05
23,27,Rumney,Henrietta,"3 Burkington Plaza, Boston",78533,(822) 989-8876,20,2012-09-05 08:42:35
24,28,Farrell,David,"437 Granite Farm Road, Westford",43532,(855) 755-9876,,2012-09-15 08:22:05
25,29,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2,2012-09-17 12:27:15
26,30,Purview,Millicent,"641 Drudgery Close, Burnington, Boston",34232,(855) 941-9786,2,2012-09-18 19:04:01
27,33,Tupperware,Hyacinth,"33 Cheerful Plaza, Drake Road, Westford",68666,(822) 665-5327,,2012-09-18 19:32:05
28,35,Hunt,John,"5 Bullington Lane, Boston",54333,(899) 720-6978,30,2012-09-19 11:32:45
29,36,Crumpet,Erica,"Crimson Road, North Reading",75655,(811) 732-4816,2,2012-09-22 08:36:38
30,37,Smith,Darren,"3 Funktown, Denzington, Boston",66796,(822) 577-3541,,2012-09-26 18:08:45

Printing data from Bookings table

In [39]:
pd.read_sql('select * from Bookings',db)

      bookid  facid  memid            starttime  slots
0          0      3      1  2012-07-03 11:00:00      2
1          1      4      1  2012-07-03 08:00:00      2
2          2      6      0  2012-07-03 18:00:00      2
3          3      7      1  2012-07-03 19:00:00      2
4          4      8      1  2012-07-03 10:00:00      1
...      ...    ...    ...                  ...    ...
4038    4038      8     29  2012-09-30 16:30:00      2
4039    4039      8     29  2012-09-30 18:00:00      1
4040    4040      8     21  2012-09-30 18:30:00      1
4041    4041      8     16  2012-09-30 19:00:00      1
4042    4042      8     29  2012-09-30 19:30:00      1

[4043 rows x 5 columns]

Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [41]:
pd.read_sql('select sub.name,sub.Revenue from (select f.name,sum(case when b.memid = 0 then b.slots * f.guestcost else b.slots * f.membercost end) as Revenue from Facilities f inner join Bookings b on f.facid = b.facid left outer join Members m on m.memid = b.memid group by f.name ) sub where sub.Revenue < 1000 order by Revenue',db)

            name  Revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

Produce a report of members and who recommended them in alphabetic surname,firstname order

In [51]:
pd.read_sql("select m2.surname || ',' || m2.firstname as Member, m1.surname || ',' || m1.firstname as Recommender from Members m1 inner join Members m2 on m1.memid = m2.recommendedby order by m2.surname, m2.firstname",db)

                     Member        Recommender
0            Bader,Florence    Stibbons,Ponder
1                Baker,Anne    Stibbons,Ponder
2             Baker,Timothy     Farrell,Jemima
3                Boothe,Tim         Rownam,Tim
4            Butters,Gerald       Smith,Darren
5               Coplin,Joan      Baker,Timothy
6             Crumpet,Erica        Smith,Tracy
7                Dare,Nancy    Joplette,Janice
8           Genting,Matthew     Butters,Gerald
9                 Hunt,John  Purview,Millicent
10              Jones,David    Joplette,Janice
11            Jones,Douglas        Jones,David
12          Joplette,Janice       Smith,Darren
13           Mackenzie,Anna       Smith,Darren
14             Owen,Charles       Smith,Darren
15             Pinker,David     Farrell,Jemima
16        Purview,Millicent        Smith,Tracy
17         Rumney,Henrietta    Genting,Matthew
18         Sarwin,Ramnaresh     Bader,Florence
19               Smith,Jack       Smith,Darren
20          Stibbons,Ponder       Tracy,Burton
21  Worthington-Smyth,Henry        Smith,Tracy

Find the facilities with their usage by member, but not guests

In [52]:
pd.read_sql("select f.name, sum(b.slots) as 'Usage' from Facilities f inner join Bookings b on f.facid = b.facid and b.memid <> 0 group by b.facid",db)

              name  Usage
0   Tennis Court 1    957
1   Tennis Court 2    882
2  Badminton Court   1086
3     Table Tennis    794
4   Massage Room 1    884
5   Massage Room 2     54
6     Squash Court    418
7    Snooker Table    860
8       Pool Table    856

Find the facilities usage by month, but not guests

In [56]:
pd.read_sql("select f.name,strftime('%Y-%m',b.starttime) as Month, sum(b.slots) as 'Usage' from Facilities f inner join Bookings b on f.facid = b.facid and b.memid <> 0 group by b.facid, Month;",db)

               name    Month  Usage
0    Tennis Court 1  2012-07    201
1    Tennis Court 1  2012-08    339
2    Tennis Court 1  2012-09    417
3    Tennis Court 2  2012-07    123
4    Tennis Court 2  2012-08    345
5    Tennis Court 2  2012-09    414
6   Badminton Court  2012-07    165
7   Badminton Court  2012-08    414
8   Badminton Court  2012-09    507
9      Table Tennis  2012-07     98
10     Table Tennis  2012-08    296
11     Table Tennis  2012-09    400
12   Massage Room 1  2012-07    166
13   Massage Room 1  2012-08    316
14   Massage Room 1  2012-09    402
15   Massage Room 2  2012-07      8
16   Massage Room 2  2012-08     18
17   Massage Room 2  2012-09     28
18     Squash Court  2012-07     50
19     Squash Court  2012-08    184
20     Squash Court  2012-09    184
21    Snooker Table  2012-07    140
22    Snooker Table  2012-08    316
23    Snooker Table  2012-09    404
24       Pool Table  2012-07    110
25       Pool Table  2012-08    303
26       Pool Table  2012-09    443